%% 激光光学教材P41
syms L n1 n2 f rho h1 h2 gamma n0 n d M r;
syms f1 f2 MT delta lamda a R m phi L;

%% 距离为L的自由空间，n=1
M=[1,L;0,1];
M(1,1)=1     ;
M(1,2)=L     ;
M(2,1)=0     ;
M(2,2)=1     ;

%% 界面折射，折射率分别为n1、n2
M=[1,0;0,n1/n2];
M(1,1)=1     ;
M(1,2)=0     ;
M(2,1)=0    ;
M(2,2)=n1/n2     ;

%% 折射率n长L的均匀介质
M=[1,L/n;0,1];
M(1,1)=1     ;
M(1,2)=L/n   ;
M(2,1)=0    ;
M(2,2)=1     ;

%% 薄透镜，焦距为f
M=[1,0;-1/f,1];
M(1,1)=1     ;
M(1,2)=0   ;
M(2,1)=-1/f    ;
M(2,2)=1     ;

%% 球面反射镜曲率半径rho
M=[1,0;-2/rho,1];
M(1,1)=1     ;
M(1,2)=0   ;
M(2,1)=-2/rho    ;
M(2,2)=1     ;

%% 球面折射
M=[1,0;(n2-n1)/(n2*rho),n1/n2];
M(1,1)=1     ;
M(1,2)=0   ;
M(2,1)=(n2-n1)/(n2*rho)    ;
M(2,2)=n1/n2     ;

%% 厚透镜
M=[(1-h2/f),(h1+h2-h1*h2/f);(-1/f),1-h1/f];
M(1,1)=1-h2/f     ;
M(1,2)=h1+h2-h1*h2/f   ;
M(2,1)=-1/f    ;
M(2,2)=1-h1/f     ;


%% 平面反射
M=[1,0;0,1];
M(1,1)=1     ;
M(1,2)=0     ;
M(2,1)=0     ;
M(2,2)=1     ;



%% 薄透镜序列
% 其中，phi满足cos(phi)=1-L/(2*f)
Q=(1/sin(phi));
%
M=[(Q*(sin(m*phi)-sin((m-1)*phi))),(Q*L*sin(m*phi)*(1-L/f)*sin(m*phi));...
    (Q*(-1/f*sin(m*phi))),(Q*(-sin((m-1)*phi)))];
M(1,1)=Q*(sin(m*phi)-sin((m-1)*phi));
M(1,2)=Q*L*sin(m*phi)*(1-L/f)*sin(m*phi)   ;
M(2,1)=Q*(-1/f*sin(m*phi))    ;
M(2,2)=Q*(-sin((m-1)*phi))    ;


























%% 热透镜
%其中,(含r表示折射率是关于半径r的函数)
n=n0*(1+gamma*r^2);
%
M=[(1+gamma*L^2),(L/n0);(2*gamma*n0*L),(1+gamma*L^2)];
M(1,1)=1+gamma*L^2     ;
M(1,2)=L/n0   ;
M(2,1)=2*gamma*n0*L   ;
M(2,2)=1+gamma*L^2     ;




%% 直角全反射棱镜
M=[-1,(-2*d/n );0,1];
M(1,1)=-1     ;
M(1,2)=-2*d/n     ;
M(2,1)=0     ;
M(2,2)=-1     ;

%% 猫眼反射器
M=[-1,0;0,-1];
M(1,1)=-1     ;
M(1,2)=0     ;
M(2,1)=0     ;
M(2,2)=-1     ;

%% 调焦望远镜
MT=-f2/f1     ;
%
M=[MT,L;0,1/MT];
M(1,1)=MT     ;
M(1,2)=L     ;
M(2,1)=0     ;
M(2,2)=1/MT     ;

%% 离焦望远镜
MT=-f2/f1     ;
delta=f1+f2-L     ;
%
M=[(MT+delta/f1 ),(L);(-delta/(f1*f2)),(1/MT+delta/f2)];
M(1,1)=MT+delta/f1     ;
M(1,2)=L     ;
M(2,1)=-delta/(f1*f2)     ;
M(2,2)=1/MT+delta/f2     ;

%% 高斯球面反射镜
%    Lambda(r)=Lambda(0)*exp[-r^2/a^2]
M=[1,0;(-2/rho-lamda/(pi*a^2)*(1i)),1];
M(1,1)=1     ;
M(1,2)=0   ;
M(2,1)=-2/rho-lamda/(pi*a^2)*(1i)    ;
M(2,2)=1     ;

%% 高斯光阑
%    t(r)=t(0)*exp[-r^2/a^2]
M=[1,0;(-lamda/(pi*a^2)*(1i)),1];
M(1,1)=1     ;
M(1,2)=0   ;
M(2,1)=-lamda/(pi*a^2)*(1i)    ;
M(2,2)=1    ;

%% 相位共轭镜 PCM
%   ???????????????????
% R为入射到PCM上的高斯光束等相位面曲率半径
M=[1,0;0,-1];
M(1,1)=1     ;
M(1,2)=0   ;
M(2,1)=0    ;
M(2,2)=-1    ;

M=[1,0;-2/R,1];
M(1,1)=1     ;
M(1,2)=0   ;
M(2,1)=-2/R    ;
M(2,2)=1    ;





%% 版本信息
% 作者:                Quincy Howard
% 联系方式：           quincy.hd@qq.com
% 文件信息更新平台为   matlab云文件、GitHub、CSDN博客、知乎
% 若使用请注明来源
% 最后编辑于           2024 年 07 月 10 日